import React, { useState, useRef, useEffect } from 'react';
import {
  Item,
  Comment,
  ReadAllBtn,
  Nickname,
  DateComment,
} from './ReviewsItem.styled';

const ReviewsItem = () => {
  const [readAll, setReadAll] = useState(false);
  const [
    // showButton,
    setShowButton,
  ] = useState(false);

  const commentHeigth = useRef(null);

  useEffect(() => {
    if (commentHeigth.current.offsetHeigth >= '80px') {
      setShowButton(true);
    }
  }, [setShowButton]);

  return (
    <>
      <Item>
        <span style={{ marginBottom: '8px' }}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="96"
            height="20"
            fill="none"
            viewBox="0 0 96 20"
          >
            <path
              fill="#E68314"
              d="M15.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.656-3.951a1.139 1.139 0 012.102 0l1.662 3.951 4.242.368a1.142 1.142 0 01.65 2.003H15.6zM35.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H35.6zM55.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H55.6zM75.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H75.6zM95.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H95.6z"
            ></path>
          </svg>
        </span>

        <Comment ref={commentHeigth}>
          Я просто захоплений якістю цього корму для собак! Мій чотирилапий
          друг, Рекс, завжди був вибагливим стосовно їжі, але цей корм змінив
          усе. Він їсть його з таким задоволенням, начебто кожен прикладний раз
          це свято.
        </Comment>

        <Nickname>Кирило Буданов</Nickname>
        <DateComment>25.07. 2023</DateComment>
      </Item>
      <Item>
        <span style={{ marginBottom: '8px' }}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="96"
            height="20"
            fill="none"
            viewBox="0 0 96 20"
          >
            <path
              fill="#E68314"
              d="M15.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.656-3.951a1.139 1.139 0 012.102 0l1.662 3.951 4.242.368a1.142 1.142 0 01.65 2.003H15.6zM35.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H35.6zM55.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H55.6zM75.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H75.6zM95.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H95.6z"
            ></path>
          </svg>
        </span>
        <Comment ref={commentHeigth} readAll={readAll}>
          Спробував цей корм за рекомендацією знайомого, але не був вражений.
          Моя собака, Барон, мало зацікавився ним і не показав особливого
          інтересу під час годівлі. Я просто захоплений якістю цього корму для
          собак! Мій чотирилапий друг, Рекс, завжди був вибагливим стосовно їжі,
          але цей корм змінив усе. Він їсть його з таким задоволенням, начебто
          кожен прикладний раз це свято. Після переходу на цей корм, я помітив,
          що його енергія знизилася, а шерсть почала випадати частіше, ніж
          раніше.Спробував цей корм за рекомендацією знайомого, але не був...
        </Comment>
        <ReadAllBtn type="button" onClick={() => setReadAll(prev => !prev)}>
          {readAll ? 'Згорнути' : 'Читати відгук повністю'}
        </ReadAllBtn>
        <Nickname>Кирило Буданов</Nickname>
        <DateComment>25.07. 2023</DateComment>
      </Item>
      <Item>
        <span style={{ marginBottom: '8px' }}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="96"
            height="20"
            fill="none"
            viewBox="0 0 96 20"
          >
            <path
              fill="#E68314"
              d="M15.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.656-3.951a1.139 1.139 0 012.102 0l1.662 3.951 4.242.368a1.142 1.142 0 01.65 2.003H15.6zM35.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H35.6zM55.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H55.6zM75.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H75.6zM95.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H95.6z"
            ></path>
          </svg>
        </span>
        <Comment ref={commentHeigth} readAll={readAll}>
          Спробував цей корм за рекомендацією знайомого, але не був вражений.
          Моя собака, Барон, мало зацікавився ним і не показав особливого
          інтересу під час годівлі. Я просто захоплений якістю цього корму для
          собак! Мій чотирилапий друг, Рекс, завжди був вибагливим стосовно їжі,
          але цей корм змінив усе. Він їсть його з таким задоволенням, начебто
          кожен прикладний раз це свято. Після переходу на цей корм, я помітив,
          що його енергія знизилася, а шерсть почала випадати частіше, ніж
          раніше.Спробував цей корм за рекомендацією знайомого, але не був...
        </Comment>
        <ReadAllBtn type="button" onClick={() => setReadAll(prev => !prev)}>
          {readAll ? 'Згорнути' : 'Читати відгук повністю'}
        </ReadAllBtn>
        <Nickname>Кирило Буданов</Nickname>
        <DateComment>25.07. 2023</DateComment>
      </Item>
      <Item>
        <span style={{ marginBottom: '8px' }}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="96"
            height="20"
            fill="none"
            viewBox="0 0 96 20"
          >
            <path
              fill="#E68314"
              d="M15.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.656-3.951a1.139 1.139 0 012.102 0l1.662 3.951 4.242.368a1.142 1.142 0 01.65 2.003H15.6zM35.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H35.6zM55.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H55.6zM75.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H75.6zM95.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H95.6z"
            ></path>
          </svg>
        </span>
        <Comment ref={commentHeigth} readAll={readAll}>
          Спробував цей корм за рекомендацією знайомого, але не був вражений.
          Моя собака, Барон, мало зацікавився ним і не показав особливого
          інтересу під час годівлі. Я просто захоплений якістю цього корму для
          собак! Мій чотирилапий друг, Рекс, завжди був вибагливим стосовно їжі,
          але цей корм змінив усе. Він їсть його з таким задоволенням, начебто
          кожен прикладний раз це свято. Після переходу на цей корм, я помітив,
          що його енергія знизилася, а шерсть почала випадати частіше, ніж
          раніше.Спробував цей корм за рекомендацією знайомого, але не був...
        </Comment>
        <ReadAllBtn type="button" onClick={() => setReadAll(prev => !prev)}>
          {readAll ? 'Згорнути' : 'Читати відгук повністю'}
        </ReadAllBtn>
        <Nickname>Кирило Буданов</Nickname>
        <DateComment>25.07. 2023</DateComment>
      </Item>
      <Item>
        <span style={{ marginBottom: '8px' }}>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="96"
            height="20"
            fill="none"
            viewBox="0 0 96 20"
          >
            <path
              fill="#E68314"
              d="M15.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.656-3.951a1.139 1.139 0 012.102 0l1.662 3.951 4.242.368a1.142 1.142 0 01.65 2.003H15.6zM35.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H35.6zM55.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.242.368a1.142 1.142 0 01.65 2.003H55.6zM75.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H75.6zM95.6 9.314l-3.219 2.81.964 4.182a1.142 1.142 0 01-1.701 1.238l-3.649-2.213-3.64 2.213a1.142 1.142 0 01-1.702-1.238l.963-4.178-3.22-2.814a1.142 1.142 0 01.65-2.003l4.245-.368 1.657-3.951a1.138 1.138 0 012.1 0l1.663 3.951 4.243.368a1.142 1.142 0 01.65 2.003H95.6z"
            ></path>
          </svg>
        </span>
        <Comment ref={commentHeigth} readAll={readAll}>
          Спробував цей корм за рекомендацією знайомого, але не був вражений.
          Моя собака, Барон, мало зацікавився ним і не показав особливого
          інтересу під час годівлі. Я просто захоплений якістю цього корму для
          собак! Мій чотирилапий друг, Рекс, завжди був вибагливим стосовно їжі,
          але цей корм змінив усе. Він їсть його з таким задоволенням, начебто
          кожен прикладний раз це свято. Після переходу на цей корм, я помітив,
          що його енергія знизилася, а шерсть почала випадати частіше, ніж
          раніше.Спробував цей корм за рекомендацією знайомого, але не був...
        </Comment>
        <ReadAllBtn type="button" onClick={() => setReadAll(prev => !prev)}>
          {readAll ? 'Згорнути' : 'Читати відгук повністю'}
        </ReadAllBtn>
        <Nickname>Кирило Буданов</Nickname>
        <DateComment>25.07. 2023</DateComment>
      </Item>
    </>
  );
};

export default ReviewsItem;
