import React, { useState } from 'react';
// import products from '../../DB/products.json';
import { DescriptionContainer, ReadAllBtn } from './ProductDescription.styled';

const ProductDescription = () => {
  const [readAll, setReadAll] = useState(false);
  return (
    <DescriptionContainer>
      <div
        style={
          readAll
            ? { overflow: 'auto' }
            : { overflow: 'hidden', height: '120px' }
        }
      >
        <p>
          Сухий корм для цуценят великих порід віком від 2 до 15 місяців.
          Забезпечує оптимальне живлення організму для підтримання необхідного
          рівня активності та енергії. Сприяє зміцненню кісток та суглобів. Не
          порушує баланс мікрофлори в кишківнику та забезпечує комфортне
          травлення. Підтримує природні захисні сили організму та є бар'єром від
          негативного впливу зовнішнього середовища. Дозволяє комфортно повністю
          перейти на сухий корм. Сприяє здоровій шкірі та красивій шерсті. Сухий
          корм для цуценят великих порід віком від 2 до 15 місяців. Забезпечує
          оптимальне живлення організму для підтримання необхідного рівня
          активності та енергії. Сприяє зміцненню кісток та суглобів. Не порушує
          баланс мікрофлори в кишківнику та забезпечує комфортне травлення.
          Підтримує природні захисні сили організму та є бар'єром від
          негативного впливу зовнішнього середовища. Дозволяє комфортно повністю
          перейти на сухий корм. Сприяє здоровій шкірі та красивій шерсті. Сухий
          корм для цуценят великих порід віком від 2 до 15 місяців. Забезпечує
          оптимальне живлення організму для підтримання необхідного рівня
          активності та енергії. Сприяє зміцненню кісток та суглобів. Не порушує
          баланс мікрофлори в кишківнику та забезпечує комфортне травлення.
          Підтримує природні захисні сили організму та є бар'єром від
          негативного впливу зовнішнього середовища. Дозволяє комфортно повністю
          перейти на сухий корм. Сприяє здоровій шкірі та красивій шерсті.
        </p>
      </div>
      <ReadAllBtn type="button" onClick={() => setReadAll(prev => !prev)}>
        {readAll ? 'Згорнути' : 'Читати повністю'}
      </ReadAllBtn>
    </DescriptionContainer>
  );
};

export default ProductDescription;
